index.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+options: email:nil f:t inline:t num:nil p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: Common Shell initialization files
#+date: <2024-03-12 Tue>
#+author: Kristian Alexander P
#+email: alexforsale@yahoo.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.2 (Org mode 9.6.15)
#+cite_export:
#+startup: indent fold
#+export_file_name: index.html
#+setupfile: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+HTML_HEAD: <style> p{max-width:800px;}</style>
#+HTML_HEAD: <style> li{max-width:800px;}</style>

This repository is a collection of common POSIX-compliant shells configuration files that I used.
* .shrc
:PROPERTIES:
:header-args: :tangle .shrc :shebang #!/bin/sh
:END:

Taken from /FreeBSD/. This file will be used if the shell is invoked for interactive use and the environment variable ENV is set to this file.
#+begin_src sh -n
  # $FreeBSD$
  #
  # .shrc - bourne shell startup file
  #
  # This file will be used if the shell is invoked for interactive use and
  # the environment variable ENV is set to this file.
  #
  # see also sh(1), environ(7).
  #

  # file permissions: rwxr-xr-x
  #
  # umask	022

  # Uncomment this to enable the builtin vi(1) command line editor in sh(1),
  # e.g. ESC to go into visual mode.
  # set -o vi

  if ([ "${SHELL}" != "/bin/sh" ] && [ "${SHELL}" != "/bin/dash" ]);then
     return
  fi

  alias h='fc -l'
  alias j=jobs
  alias m="$PAGER"
  alias ll='ls -laFo'
  alias l='ls -l'
  alias g='egrep -i'

  # # be paranoid
  # alias cp='cp -ip'
  # alias mv='mv -i'
  # alias rm='rm -i'

  # set prompt: ``username@hostname:directory $ ''
  if [ "${DISTRO}" = "freebsd" ]; then
      PS1="\u@\h:\w \\$ "
  else
      PS1="${USER}@${HOSTNAME}:\${PWD} $ "
  fi

  # search path for cd(1)
  # CDPATH=:$HOME
#+end_src
This file itself will only be called from the system / user profile (=/etc/profile= or =~/.profile=).
* .login
:PROPERTIES:
:header-args: :tangle .login :shebang #!/usr/bin/env tcsh
:END:

Used by =csh= and =tcsh=. Read after =.cshrc= at login.
#+begin_src sh -n
  # -*- mode: sh -*-
  # $FreeBSD$
  #
  # .login - csh login script, read by login shell, after `.cshrc' at login.
  #
  # See also csh(1), environ(7).
  #

  # Query terminal size; useful for serial lines.
  if ( -x /usr/bin/resizewin ) /usr/bin/resizewin -z
#+end_src

* .logout
:PROPERTIES:
:header-args: :tangle .logout :shebang #!/usr/bin/env tcsh
:END:

#+begin_src sh -n
  # -*- mode: sh -*-
  #
  # .logout - csh logout script
  #

  if ( -x `which clear` ) clear
#+end_src

