index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-09 Sun 14:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Common Shell initialization files</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kristian Alexander P" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Common Shell initialization files</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfb030f0"><code>.shrc</code></a></li>
<li><a href="#org99410bb"><code>.login</code></a></li>
<li><a href="#orgda2be10"><code>.logout</code></a></li>
<li><a href="#org8ee50f2"><code>.profile</code></a>
<ul>
<li><a href="#org3b35895">Modules</a>
<ul>
<li><a href="#org56ccb64">distro</a></li>
<li><a href="#org871fe4d">locale</a></li>
<li><a href="#org1d2f2ab">xdg-base-directory</a></li>
<li><a href="#orge61c4b7">editors</a></li>
<li><a href="#org0a50a7f">terminals</a></li>
<li><a href="#org005a341">security</a></li>
<li><a href="#orgd53ecfe">file managers</a></li>
<li><a href="#org1895f22">browser</a></li>
<li><a href="#org39facf3">mail apps</a></li>
<li><a href="#org78c2cdd">themes</a></li>
<li><a href="#org7598764">cargo</a></li>
<li><a href="#orgd4f7495">ccache</a></li>
<li><a href="#org0b45d19">composer</a></li>
<li><a href="#org030e137">dash</a></li>
<li><a href="#org5a53dbe">doom emacs</a></li>
<li><a href="#org6002f99">elinks</a></li>
<li><a href="#orge0579dd">emacs vterm</a></li>
<li><a href="#org214192e">freeBSD</a></li>
<li><a href="#orgba5d671">fsharp</a></li>
<li><a href="#org3b026b3">ghcup</a></li>
<li><a href="#org21aa1b9">go</a></li>
<li><a href="#orgb1eaf6f">guix</a></li>
<li><a href="#org56548fb">nano</a></li>
<li><a href="#org5b831f2">nix</a></li>
<li><a href="#orga883b5c">npm</a></li>
<li><a href="#org9b9cd8e">password-store</a></li>
<li><a href="#org4505a3d">perl</a></li>
<li><a href="#orgea90d66">python</a></li>
<li><a href="#orgefd3b92">ruby</a></li>
<li><a href="#org4828c7b">screen</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This repository is a collection of common POSIX-compliant shells configuration files that I used.
</p>
<div id="outline-container-orgfb030f0" class="outline-2">
<h2 id="orgfb030f0"><code>.shrc</code></h2>
<div class="outline-text-2" id="text-orgfb030f0">
<p>
Taken from <i>FreeBSD</i>. This file will be used if the shell is invoked for interactive use and the environment variable ENV is set to this file.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">$FreeBSD$</span>
<span class="linenr"> 2: </span><span style="color: #b22222;">#</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">.shrc - bourne shell startup file</span>
<span class="linenr"> 4: </span><span style="color: #b22222;">#</span>
<span class="linenr"> 5: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">This file will be used if the shell is invoked for interactive use and</span>
<span class="linenr"> 6: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">the environment variable ENV is set to this file.</span>
<span class="linenr"> 7: </span><span style="color: #b22222;">#</span>
<span class="linenr"> 8: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">see also sh(1), environ(7).</span>
<span class="linenr"> 9: </span><span style="color: #b22222;">#</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">file permissions: rwxr-xr-x</span>
<span class="linenr">12: </span><span style="color: #b22222;">#</span>
<span class="linenr">13: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">umask 022</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment this to enable the builtin vi(1) command line editor in sh(1),</span>
<span class="linenr">16: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">e.g. ESC to go into visual mode.</span>
<span class="linenr">17: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">set -o vi</span>
<span class="linenr">18: </span>
<span class="linenr">19: </span><span style="color: #4169e1;">if</span> ([ <span style="color: #bc8f8f;">"${SHELL}"</span> != <span style="color: #bc8f8f;">"/bin/sh"</span> ] &amp;&amp; [ <span style="color: #bc8f8f;">"${SHELL}"</span> != <span style="color: #bc8f8f;">"/bin/dash"</span> ]);<span style="color: #4169e1;">then</span>
<span class="linenr">20: </span>   <span style="color: #4169e1;">return</span>
<span class="linenr">21: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">22: </span>
<span class="linenr">23: </span>alias <span style="color: #b8860b;">h</span>=<span style="color: #bc8f8f;">'fc -l'</span>
<span class="linenr">24: </span>alias <span style="color: #b8860b;">j</span>=jobs
<span class="linenr">25: </span>alias <span style="color: #b8860b;">m</span>=<span style="color: #bc8f8f;">"$PAGER"</span>
<span class="linenr">26: </span>alias <span style="color: #b8860b;">ll</span>=<span style="color: #bc8f8f;">'ls -laFo'</span>
<span class="linenr">27: </span>alias <span style="color: #b8860b;">l</span>=<span style="color: #bc8f8f;">'ls -l'</span>
<span class="linenr">28: </span>alias <span style="color: #b8860b;">g</span>=<span style="color: #bc8f8f;">'egrep -i'</span>
<span class="linenr">29: </span>
<span class="linenr">30: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"># be paranoid</span>
<span class="linenr">31: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">alias cp='cp -ip'</span>
<span class="linenr">32: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">alias mv='mv -i'</span>
<span class="linenr">33: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">alias rm='rm -i'</span>
<span class="linenr">34: </span>
<span class="linenr">35: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">set prompt: ``username@hostname:directory $ ''</span>
<span class="linenr">36: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"${DISTRO}"</span> = <span style="color: #bc8f8f;">"freebsd"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">37: </span>    <span style="color: #b8860b;">PS1</span>=<span style="color: #bc8f8f;">"\u@\h:\w \\$ "</span>
<span class="linenr">38: </span><span style="color: #4169e1;">else</span>
<span class="linenr">39: </span>    <span style="color: #b8860b;">PS1</span>=<span style="color: #bc8f8f;">"${USER}@${HOSTNAME}:\${PWD} $ "</span>
<span class="linenr">40: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">41: </span>
<span class="linenr">42: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">search path for cd(1)</span>
<span class="linenr">43: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">CDPATH=:$HOME</span>
</pre>
</div>
<p>
This file itself will only be called from the system / user profile (<code>/etc/profile</code> or <code>~/.profile</code>).
</p>
</div>
</div>
<div id="outline-container-org99410bb" class="outline-2">
<h2 id="org99410bb"><code>.login</code></h2>
<div class="outline-text-2" id="text-org99410bb">
<p>
Used by <code>csh</code> and <code>tcsh</code>. Read after <code>.cshrc</code> at login.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">-*- mode: sh -*-</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">$FreeBSD$</span>
<span class="linenr"> 3: </span><span style="color: #b22222;">#</span>
<span class="linenr"> 4: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">.login - csh login script, read by login shell, after `.cshrc' at login.</span>
<span class="linenr"> 5: </span><span style="color: #b22222;">#</span>
<span class="linenr"> 6: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">See also csh(1), environ(7).</span>
<span class="linenr"> 7: </span><span style="color: #b22222;">#</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Query terminal size; useful for serial lines.</span>
<span class="linenr">10: </span><span style="color: #4169e1;">if</span> ( -x /usr/bin/resizewin ) /usr/bin/resizewin -z
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda2be10" class="outline-2">
<h2 id="orgda2be10"><code>.logout</code></h2>
<div class="outline-text-2" id="text-orgda2be10">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr">1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">-*- mode: sh -*-</span>
<span class="linenr">2: </span><span style="color: #b22222;">#</span>
<span class="linenr">3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">.logout - csh logout script</span>
<span class="linenr">4: </span><span style="color: #b22222;">#</span>
<span class="linenr">5: </span>
<span class="linenr">6: </span><span style="color: #4169e1;">if</span> ( -x <span style="font-weight: bold;">`which clear`</span> ) clear
</pre>
</div>
</div>
</div>
