index.org
* .profile
:PROPERTIES:
:header-args: :tangle .profile :shebang #!/bin/sh
:END:

Used by various shells. It is important to keep this script POSIX-compliant since there's more than one shell depends on it.
#+begin_src sh -n
  # ~/.profile
  # Environment and startup programs.
  # source /etc/profile if exist.
  # <alexforsale@yahoo.com>
  #

  [ -f /etc/profile ] && . /etc/profile

  # this goes first in case others needs it.
  if [ -d "${HOME}/bin" ] ; then
      export PATH="${HOME}/bin:${PATH}"
  fi
  if [ -d "$HOME/.local/bin" ];then
     export PATH="${HOME}/.local/bin:${PATH}"
  fi

  # Loads user profiles if exists. Should be in ~/.profile.d
  # but let's not pollute ~ anymore.

  if [ -d "${HOME}/.config/profile.d" ]; then
      for profile in "${HOME}"/.config/profile.d/*.sh; do
          . "${profile}"
      done
      unset profile
  fi

  if [ -n "${PATH}" ]; then
      old_PATH=${PATH}:; PATH=
      while [ -n "${old_PATH}" ]; do
          x=${old_PATH%%:*}       # the first remaining entry
          case ${PATH}: in
              ,*:"$x":*) ;;         # already there
              ,*) PATH=${PATH}:$x;;    # not there yet
          esac
          old_PATH=${old_PATH#*:}
      done
      PATH=${PATH#:}
      unset old_PATH x
  fi

  # local ~/.profile
  if [ -r "${HOME}"/.config/profile.local ];then
     . "${HOME}"/.config/profile.local
     elif [ -r "${HOME}"/.profile.local ];then
          . "${HOME}"/.profile.local
     fi

  # if running bash
  if [ -n "${BASH_VERSION}" ]; then
      # include .bashrc if it exists
      if [ -f "${HOME}/.bashrc" ]; then
          . "${HOME}/.bashrc"
      fi
  fi
#+end_src

** Modules

Their file names are prefixed with numbers =dd-filename= to ensure the order.
*** distro
:PROPERTIES:
:header-args: :tangle .config/profile.d/00-distro.sh :mkdirp t :shebang #!/bin/sh
:END:

This is an easier way for my shell scripts to query the currently running *nix distribution and their version.
#+begin_src sh
  # ~/.config/profile.d/00-distro.sh
  # set distro environment
  # <alexforsale@yahoo.com>

  # set DISTRO and DISTROVER
  if [ -f /etc/os-release ]; then
      # freedesktop.org and systemd
      . /etc/os-release
      DISTRO="${ID}"
      DISTROVER="${VERSION_ID}"
      [ -z "${DISTROVER}" ] &&
          DISTROVER="${BUILD_ID}"
  elif [ "$(command -v lsb_release >/dev/null)" ]; then
      # linuxbase.org
      DISTRO="$(lsb_release -si | awk '{print tolower ($0)}')"
      DISTROVER="$(lsb_release -sr | awk '{print tolower ($0)}')"
  elif [ -f /etc/lsb-release ]; then
      # For some versions of Debian/Ubuntu without lsb_release command
      . /etc/lsb-release
      DISTRO="${DISTRIB_ID}"
      DISTROVER="${DISTRIB_RELEASE}"
  elif [ -f /etc/debian_version ]; then
      # Older Debian/Ubuntu/etc.
      DISTRO=Debian
      DISTROVER="$(cat /etc/debian_version)"
  else
      # Fall back to uname, e.g. "Linux <version>", also works for BSD, etc.
      DISTRO="$(uname -s)"
      DISTROVER="$(uname -r)"
  fi

  # set helper functions here for now
  contains() { case "$1" in *"$2"*) true ;; *) false ;; esac }

  export DISTRO DISTROVER
#+end_src
The =contains()= function is for a quick string search.

