index.html

<div id="outline-container-org8ee50f2" class="outline-2">
<h2 id="org8ee50f2"><code>.profile</code></h2>
<div class="outline-text-2" id="text-org8ee50f2">
<p>
Used by various shells. It is important to keep this script POSIX-compliant since there's more than one shell depends on it.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.profile</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Environment and startup programs.</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">source /etc/profile if exist.</span>
<span class="linenr"> 4: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 5: </span><span style="color: #b22222;">#</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>[ -f /etc/profile ] &amp;&amp; . /etc/profile
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">this goes first in case others needs it.</span>
<span class="linenr">10: </span><span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/bin"</span> ] ; <span style="color: #4169e1;">then</span>
<span class="linenr">11: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=<span style="color: #bc8f8f;">"${HOME}/bin:${PATH}"</span>
<span class="linenr">12: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">13: </span><span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"$HOME/.local/bin"</span> ];<span style="color: #4169e1;">then</span>
<span class="linenr">14: </span>   <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=<span style="color: #bc8f8f;">"${HOME}/.local/bin:${PATH}"</span>
<span class="linenr">15: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Loads user profiles if exists. Should be in ~/.profile.d</span>
<span class="linenr">18: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">but let's not pollute ~ anymore.</span>
<span class="linenr">19: </span>
<span class="linenr">20: </span><span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.config/profile.d"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">21: </span>    <span style="color: #4169e1;">for</span> profile<span style="color: #4169e1;"> in</span> <span style="color: #bc8f8f;">"${HOME}"</span>/.config/profile.d/*.sh; <span style="color: #4169e1;">do</span>
<span class="linenr">22: </span>        . <span style="color: #bc8f8f;">"${profile}"</span>
<span class="linenr">23: </span>    <span style="color: #4169e1;">done</span>
<span class="linenr">24: </span>    <span style="color: #00008b;">unset</span> profile
<span class="linenr">25: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">26: </span>
<span class="linenr">27: </span><span style="color: #4169e1;">if</span> [ -n <span style="color: #bc8f8f;">"${PATH}"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">28: </span>    <span style="color: #b8860b;">old_PATH</span>=${<span style="color: #b8860b;">PATH</span>}:; <span style="color: #b8860b;">PATH</span>=
<span class="linenr">29: </span>    <span style="color: #4169e1;">while</span> [ -n <span style="color: #bc8f8f;">"${old_PATH}"</span> ]; <span style="color: #4169e1;">do</span>
<span class="linenr">30: </span>        <span style="color: #b8860b;">x</span>=${<span style="color: #b8860b;">old_PATH</span>%%:*}       <span style="color: #b22222;"># </span><span style="color: #b22222;">the first remaining entry</span>
<span class="linenr">31: </span>        <span style="color: #4169e1;">case</span> ${<span style="color: #b8860b;">PATH</span>}:<span style="color: #4169e1;"> in</span>
<span class="linenr">32: </span>            *:<span style="color: #bc8f8f;">"$x"</span>:*) ;;         <span style="color: #b22222;"># </span><span style="color: #b22222;">already there</span>
<span class="linenr">33: </span>            *) <span style="color: #b8860b;">PATH</span>=${<span style="color: #b8860b;">PATH</span>}:$<span style="color: #b8860b;">x</span>;;    <span style="color: #b22222;"># </span><span style="color: #b22222;">not there yet</span>
<span class="linenr">34: </span>        <span style="color: #4169e1;">esac</span>
<span class="linenr">35: </span>        <span style="color: #b8860b;">old_PATH</span>=${<span style="color: #b8860b;">old_PATH</span>#*:}
<span class="linenr">36: </span>    <span style="color: #4169e1;">done</span>
<span class="linenr">37: </span>    <span style="color: #b8860b;">PATH</span>=${<span style="color: #b8860b;">PATH</span>#:}
<span class="linenr">38: </span>    <span style="color: #00008b;">unset</span> old_PATH x
<span class="linenr">39: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">40: </span>
<span class="linenr">41: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">local ~/.profile</span>
<span class="linenr">42: </span><span style="color: #4169e1;">if</span> [ -r <span style="color: #bc8f8f;">"${HOME}"</span>/.config/profile.local ];<span style="color: #4169e1;">then</span>
<span class="linenr">43: </span>   . <span style="color: #bc8f8f;">"${HOME}"</span>/.config/profile.local
<span class="linenr">44: </span>   <span style="color: #4169e1;">elif</span> [ -r <span style="color: #bc8f8f;">"${HOME}"</span>/.profile.local ];<span style="color: #4169e1;">then</span>
<span class="linenr">45: </span>        . <span style="color: #bc8f8f;">"${HOME}"</span>/.profile.local
<span class="linenr">46: </span>   <span style="color: #4169e1;">fi</span>
<span class="linenr">47: </span>
<span class="linenr">48: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">if running bash</span>
<span class="linenr">49: </span><span style="color: #4169e1;">if</span> [ -n <span style="color: #bc8f8f;">"${BASH_VERSION}"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">50: </span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">include .bashrc if it exists</span>
<span class="linenr">51: </span>    <span style="color: #4169e1;">if</span> [ -f <span style="color: #bc8f8f;">"${HOME}/.bashrc"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">52: </span>        . <span style="color: #bc8f8f;">"${HOME}/.bashrc"</span>
<span class="linenr">53: </span>    <span style="color: #4169e1;">fi</span>
<span class="linenr">54: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>

<div id="outline-container-org3b35895" class="outline-3">
<h3 id="org3b35895">Modules</h3>
<div class="outline-text-3" id="text-org3b35895">
<p>
Their file names are prefixed with numbers <code>dd-filename</code> to ensure the order.
</p>
</div>
<div id="outline-container-org56ccb64" class="outline-4">
<h4 id="org56ccb64">distro</h4>
<div class="outline-text-4" id="text-org56ccb64">
<p>
This is an easier way for my shell scripts to query the currently running *nix distribution and their version.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/00-distro.sh</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">set distro environment</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">set DISTRO and DISTROVER</span>
<span style="color: #4169e1;">if</span> [ -f /etc/os-release ]; <span style="color: #4169e1;">then</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">freedesktop.org and systemd</span>
    . /etc/os-release
    <span style="color: #b8860b;">DISTRO</span>=<span style="color: #bc8f8f;">"${ID}"</span>
    <span style="color: #b8860b;">DISTROVER</span>=<span style="color: #bc8f8f;">"${VERSION_ID}"</span>
    [ -z <span style="color: #bc8f8f;">"${DISTROVER}"</span> ] &amp;&amp;
        <span style="color: #b8860b;">DISTROVER</span>=<span style="color: #bc8f8f;">"${BUILD_ID}"</span>
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(command -v lsb_release &gt;/dev/null)"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">linuxbase.org</span>
    <span style="color: #b8860b;">DISTRO</span>=<span style="color: #bc8f8f;">"$(lsb_release -si | awk '{print tolower ($0)}')"</span>
    <span style="color: #b8860b;">DISTROVER</span>=<span style="color: #bc8f8f;">"$(lsb_release -sr | awk '{print tolower ($0)}')"</span>
<span style="color: #4169e1;">elif</span> [ -f /etc/lsb-release ]; <span style="color: #4169e1;">then</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">For some versions of Debian/Ubuntu without lsb_release command</span>
    . /etc/lsb-release
    <span style="color: #b8860b;">DISTRO</span>=<span style="color: #bc8f8f;">"${DISTRIB_ID}"</span>
    <span style="color: #b8860b;">DISTROVER</span>=<span style="color: #bc8f8f;">"${DISTRIB_RELEASE}"</span>
<span style="color: #4169e1;">elif</span> [ -f /etc/debian_version ]; <span style="color: #4169e1;">then</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">Older Debian/Ubuntu/etc.</span>
    <span style="color: #b8860b;">DISTRO</span>=Debian
    <span style="color: #b8860b;">DISTROVER</span>=<span style="color: #bc8f8f;">"$(cat /etc/debian_version)"</span>
<span style="color: #4169e1;">else</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">Fall back to uname, e.g. "Linux &lt;version&gt;", also works for BSD, etc.</span>
    <span style="color: #b8860b;">DISTRO</span>=<span style="color: #bc8f8f;">"$(uname -s)"</span>
    <span style="color: #b8860b;">DISTROVER</span>=<span style="color: #bc8f8f;">"$(uname -r)"</span>
<span style="color: #4169e1;">fi</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">set helper functions here for now</span>
<span style="color: #0000ff;">contains</span>() { <span style="color: #4169e1;">case</span> <span style="color: #bc8f8f;">"$1"</span><span style="color: #4169e1;"> in</span> *<span style="color: #bc8f8f;">"$2"</span>*) true ;; *) false ;; <span style="color: #4169e1;">esac</span> }

<span style="color: #00008b;">export</span> DISTRO DISTROVER
</pre>
</div>
<p>
The <code>contains()</code> function is for a quick string search.
</p>
</div>
</div>
