index.org
*** locale
:PROPERTIES:
:header-args: :tangle .config/profile.d/00-locale.sh :mkdirp t :shebang #!/bin/sh
:END:

This is rarely used, most of the times the the system shell startup files already defined these variables.
#+begin_src sh -n
  # ~/.config/profile.d/00-locale.sh
  # locale settings
  # <alexforsale@yahoo.com>

  # language
  [ -z "${LANG}" ] && export LANG=en_US.UTF-8
  [ -z "${MM_CHARSET}" ] && export MM_CHARSET=en_US.UTF-8
#+end_src

