index.html

<div id="outline-container-org871fe4d" class="outline-4">
<h4 id="org871fe4d">locale</h4>
<div class="outline-text-4" id="text-org871fe4d">
<p>
This is rarely used, most of the times the the system shell startup files already defined these variables.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr">1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/00-locale.sh</span>
<span class="linenr">2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">locale settings</span>
<span class="linenr">3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr">4: </span>
<span class="linenr">5: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">language</span>
<span class="linenr">6: </span>[ -z <span style="color: #bc8f8f;">"${LANG}"</span> ] &amp;&amp; <span style="color: #00008b;">export</span> <span style="color: #b8860b;">LANG</span>=en_US.UTF-8
<span class="linenr">7: </span>[ -z <span style="color: #bc8f8f;">"${MM_CHARSET}"</span> ] &amp;&amp; <span style="color: #00008b;">export</span> <span style="color: #b8860b;">MM_CHARSET</span>=en_US.UTF-8
</pre>
</div>
</div>
</div>
