index.org
*** editors
:PROPERTIES:
:header-args: :tangle .config/profile.d/02-editors.sh :mkdirp t :shebang #!/bin/sh
:END:

- $EDITOR :: Application set as this variable should be able to operate without the "advanced" terminal functionalities. Most of the times, =vi= is the default $EDITOR
- $VISUAL :: for fullscreen editors.
#+begin_src sh -n
  # ~/.config/profile.d/02-editors.sh
  # ${EDITOR}, ${VISUAL} and ${ALTERNATE_EDITOR}
  # <alexforsale@yahoo.com>

  # chemacs-profile
  if [ -e "${HOME}/.config/chemacs/profile" ]; then
      export CHEMACS_PROFILE="$(cat ${HOME}/.config/chemacs/profile)"
  elif [ -e "${HOME}/.emacs-profile" ]; then
      export CHEMACS_PROFILE="$(cat ${HOME}/.emacs-profile)"
  fi

  [ -n "${CHEMACS_PROFILE}" ] && emacs_args="-s ${CHEMACS_PROFILE}"

  # see https://unix.stackexchange.com/questions/4859/visual-vs-editor-what-s-the-difference
  if [ "$(command -v emacs)" ]; then
      export VISUAL="${VISUAL:-emacsclient -c} ${emacs_args}"
      export EDITOR="${EDITOR:-emacsclient -t} ${emacs_args}"
      export ALTERNATE_EDITOR=${VISUAL}
  elif [ "$(command -v gvim)" ]; then # in case it's available, I don't use much of this
      export EDITOR="${EDITOR:-vim}"  # this should also installed
      export VISUAL="${VISUAL:-gvim}"
  elif [ "$(command -v vim)" ]; then # most distro provide this (linux that is)
      export EDITOR="${EDITOR:-vim}"
      export VISUAL="${VISUAL:-vim}"
  else
      [ $(command -v nvim) ] &&
          export EDITOR="${EDITOR:-nvim}"

      [ $(command -v leafpad) ] &&
          export EDITOR="${EDITOR:-leafpad}"

      [ $(command -v l3afpad) ] &&
          export EDITOR="${EDITOR:-l3afpad}"

      [ $(command -v kate) ] &&
          export EDITOR="${EDITOR:-kate}"

      [ $(command -v pluma) ] &&
          export EDITOR="${EDITOR:-pluma}"

      [ $(command -v kwrite) ] &&
          export EDITOR="${EDITOR:-kwrite}"

      [ $(command -v scribe) ] &&
          export EDITOR="${EDITOR:-scribe}"

      [ $(command -v geany) ] &&
          export EDITOR="${EDITOR:-geany}"

      [ $(command -v gedit) ] &&
          export EDITOR="${EDITOR:-gedit}"

      [ $(command -v code) ] &&
          export EDITOR="${EDITOR:-code}"

      # most unix os provide this,
      [ $(command -v vi) ] &&
          export EDITOR="${EDITOR:-vi}"

      export VISUAL=${EDITOR}
      export ALTERNATE_EDITOR=${EDITOR}
  fi

  # if [ "%(command -v nvim)" ]; then
  #     export GVIMINIT='let $MYGVIMRC = !has("nvim") ? "$XDG_CONFIG_HOME/vim/gvimrc" : "$XDG_CONFIG_HOME/nvim/init.gvim" | so $MYGVIMRC'
  #     export VIMINIT='let $MYVIMRC = !has("nvim") ? "$XDG_CONFIG_HOME/vim/vimrc" : "$XDG_CONFIG_HOME/nvim/init.vim" | so $MYVIMRC'
  # elif [ "$(command -v vim)" ]; then
  #     export GVIMINIT='let $MYGVIMRC="$XDG_CONFIG_HOME/vim/gvimrc" | source $MYGVIMRC'
  #     export VIMINIT='let $MYVIMRC="$XDG_CONFIG_HOME/vim/vimrc" | source $MYVIMRC'
  # fi
#+end_src

- $CHEMACS_PROFILE :: This variable is used as a tweak to have multiple Emacs configurations[fn:1].
- VIM / GVIM / NVIM :: I used to set the VIMRC variable to =~/.config= directory. Commented since I rarely used them, their defaults is good enough fo a quick editing.
