index.html

<div id="outline-container-orge61c4b7" class="outline-4">
<h4 id="orge61c4b7">editors</h4>
<div class="outline-text-4" id="text-orge61c4b7">
<dl class="org-dl">
<dt>$EDITOR</dt><dd>Application set as this variable should be able to operate without the "advanced" terminal functionalities. Most of the times, <code>vi</code> is the default $EDITOR</dd>
<dt>$VISUAL</dt><dd>for fullscreen editors.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/02-editors.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">${EDITOR}, ${VISUAL} and ${ALTERNATE_EDITOR}</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">chemacs-profile</span>
<span class="linenr"> 6: </span><span style="color: #4169e1;">if</span> [ -e <span style="color: #bc8f8f;">"${HOME}/.config/chemacs/profile"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 7: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">CHEMACS_PROFILE</span>=<span style="color: #bc8f8f;">"$(cat ${HOME}/.config/chemacs/profile)"</span>
<span class="linenr"> 8: </span><span style="color: #4169e1;">elif</span> [ -e <span style="color: #bc8f8f;">"${HOME}/.emacs-profile"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 9: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">CHEMACS_PROFILE</span>=<span style="color: #bc8f8f;">"$(cat ${HOME}/.emacs-profile)"</span>
<span class="linenr">10: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>[ -n <span style="color: #bc8f8f;">"${CHEMACS_PROFILE}"</span> ] &amp;&amp; <span style="color: #b8860b;">emacs_args</span>=<span style="color: #bc8f8f;">"-s ${CHEMACS_PROFILE}"</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">see https://unix.stackexchange.com/questions/4859/visual-vs-editor-what-s-the-difference</span>
<span class="linenr">15: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(command -v emacs)"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">16: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">VISUAL</span>=<span style="color: #bc8f8f;">"${VISUAL:-emacsclient -c} ${emacs_args}"</span>
<span class="linenr">17: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-emacsclient -t} ${emacs_args}"</span>
<span class="linenr">18: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">ALTERNATE_EDITOR</span>=${<span style="color: #b8860b;">VISUAL</span>}
<span class="linenr">19: </span><span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(command -v gvim)"</span> ]; <span style="color: #4169e1;">then</span> <span style="color: #b22222;"># </span><span style="color: #b22222;">in case it's available, I don't use much of this</span>
<span class="linenr">20: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-vim}"</span>  <span style="color: #b22222;"># </span><span style="color: #b22222;">this should also installed</span>
<span class="linenr">21: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">VISUAL</span>=<span style="color: #bc8f8f;">"${VISUAL:-gvim}"</span>
<span class="linenr">22: </span><span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(command -v vim)"</span> ]; <span style="color: #4169e1;">then</span> <span style="color: #b22222;"># </span><span style="color: #b22222;">most distro provide this (linux that is)</span>
<span class="linenr">23: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-vim}"</span>
<span class="linenr">24: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">VISUAL</span>=<span style="color: #bc8f8f;">"${VISUAL:-vim}"</span>
<span class="linenr">25: </span><span style="color: #4169e1;">else</span>
<span class="linenr">26: </span>    [ $(command -v nvim) ] &amp;&amp;
<span class="linenr">27: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-nvim}"</span>
<span class="linenr">28: </span>
<span class="linenr">29: </span>    [ $(command -v leafpad) ] &amp;&amp;
<span class="linenr">30: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-leafpad}"</span>
<span class="linenr">31: </span>
<span class="linenr">32: </span>    [ $(command -v l3afpad) ] &amp;&amp;
<span class="linenr">33: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-l3afpad}"</span>
<span class="linenr">34: </span>
<span class="linenr">35: </span>    [ $(command -v kate) ] &amp;&amp;
<span class="linenr">36: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-kate}"</span>
<span class="linenr">37: </span>
<span class="linenr">38: </span>    [ $(command -v pluma) ] &amp;&amp;
<span class="linenr">39: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-pluma}"</span>
<span class="linenr">40: </span>
<span class="linenr">41: </span>    [ $(command -v kwrite) ] &amp;&amp;
<span class="linenr">42: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-kwrite}"</span>
<span class="linenr">43: </span>
<span class="linenr">44: </span>    [ $(command -v scribe) ] &amp;&amp;
<span class="linenr">45: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-scribe}"</span>
<span class="linenr">46: </span>
<span class="linenr">47: </span>    [ $(command -v geany) ] &amp;&amp;
<span class="linenr">48: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-geany}"</span>
<span class="linenr">49: </span>
<span class="linenr">50: </span>    [ $(command -v gedit) ] &amp;&amp;
<span class="linenr">51: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-gedit}"</span>
<span class="linenr">52: </span>
<span class="linenr">53: </span>    [ $(command -v code) ] &amp;&amp;
<span class="linenr">54: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-code}"</span>
<span class="linenr">55: </span>
<span class="linenr">56: </span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">most unix os provide this,</span>
<span class="linenr">57: </span>    [ $(command -v vi) ] &amp;&amp;
<span class="linenr">58: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EDITOR</span>=<span style="color: #bc8f8f;">"${EDITOR:-vi}"</span>
<span class="linenr">59: </span>
<span class="linenr">60: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">VISUAL</span>=${<span style="color: #b8860b;">EDITOR</span>}
<span class="linenr">61: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">ALTERNATE_EDITOR</span>=${<span style="color: #b8860b;">EDITOR</span>}
<span class="linenr">62: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">63: </span>
<span class="linenr">64: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">if [ "%(command -v nvim)" ]; then</span>
<span class="linenr">65: </span><span style="color: #b22222;">#     </span><span style="color: #b22222;">export GVIMINIT='let $MYGVIMRC = !has("nvim") ? "$XDG_CONFIG_HOME/vim/gvimrc" : "$XDG_CONFIG_HOME/nvim/init.gvim" | so $MYGVIMRC'</span>
<span class="linenr">66: </span><span style="color: #b22222;">#     </span><span style="color: #b22222;">export VIMINIT='let $MYVIMRC = !has("nvim") ? "$XDG_CONFIG_HOME/vim/vimrc" : "$XDG_CONFIG_HOME/nvim/init.vim" | so $MYVIMRC'</span>
<span class="linenr">67: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">elif [ "$(command -v vim)" ]; then</span>
<span class="linenr">68: </span><span style="color: #b22222;">#     </span><span style="color: #b22222;">export GVIMINIT='let $MYGVIMRC="$XDG_CONFIG_HOME/vim/gvimrc" | source $MYGVIMRC'</span>
<span class="linenr">69: </span><span style="color: #b22222;">#     </span><span style="color: #b22222;">export VIMINIT='let $MYVIMRC="$XDG_CONFIG_HOME/vim/vimrc" | source $MYVIMRC'</span>
<span class="linenr">70: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">fi</span>
</pre>
</div>

<dl class="org-dl">
<dt>$CHEMACS_PROFILE</dt><dd>This variable is used as a tweak to have multiple Emacs configurations<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.</dd>
<dt>VIM / GVIM / NVIM</dt><dd>I used to set the VIMRC variable to <code>~/.config</code> directory. Commented since I rarely used them, their defaults is good enough fo a quick editing.</dd>
</dl>
</div>
</div>
