index.html

<div id="outline-container-org005a341" class="outline-4">
<h4 id="org005a341">security</h4>
<div class="outline-text-4" id="text-org005a341">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/04-security.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">various security apps</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">from https://www.gnupg.org/documentation/manuals/gnupg/Invoking-GPG_002dAGENT.html</span>
<span class="linenr"> 6: </span><span style="color: #00008b;">export</span> <span style="color: #b8860b;">GPG_TTY</span>=<span style="color: #bc8f8f;">"$(tty)"</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">https://wiki.gentoo.org/wiki/GnuPG#Automatically_starting_the_GPG_agent</span>
<span class="linenr"> 9: </span><span style="color: #4169e1;">if</span> [ -n <span style="color: #bc8f8f;">"$SSH_CONNECTION"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">10: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PINENTRY_USER_DATA</span>=<span style="color: #bc8f8f;">"USE_CURSES=1"</span>
<span class="linenr">11: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">gpg-agent</span>
<span class="linenr">14: </span><span style="color: #4169e1;">case</span> <span style="color: #bc8f8f;">"${DISTRO}"</span><span style="color: #4169e1;"> in</span>
<span class="linenr">15: </span>    freebsd)
<span class="linenr">16: </span>        <span style="color: #4169e1;">for</span> i<span style="color: #4169e1;"> in</span> curses gnome3 gtk2 qt5; <span style="color: #4169e1;">do</span>
<span class="linenr">17: </span>            <span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(command -v pinentry-${i})"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">18: </span>                <span style="color: #b8860b;">_PINENTRY</span>=<span style="color: #bc8f8f;">"$(command -v pinentry-${i})"</span>
<span class="linenr">19: </span>            <span style="color: #4169e1;">else</span>
<span class="linenr">20: </span>                <span style="color: #b8860b;">_PINENTRY</span>=<span style="color: #bc8f8f;">"$(command -v pinentry)"</span>
<span class="linenr">21: </span>            <span style="color: #4169e1;">fi</span>
<span class="linenr">22: </span>        <span style="color: #4169e1;">done</span>
<span class="linenr">23: </span>
<span class="linenr">24: </span>        <span style="color: #4169e1;">if</span> [ ! <span style="color: #bc8f8f;">"$(pgrep -u "${USER}" -x gpg-agent)"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">25: </span>            /usr/local/bin/gpg-agent --enable-ssh-support <span style="color: #bc8f8f;">\</span>
<span class="linenr">26: </span>                --pinentry-program <span style="color: #bc8f8f;">"${_PINENTRY}"</span> <span style="color: #bc8f8f;">\</span>
<span class="linenr">27: </span>                --daemon <span style="color: #bc8f8f;">"$@"</span>
<span class="linenr">28: </span>            <span style="color: #4169e1;">if</span> [ -f <span style="color: #bc8f8f;">"${HOME}/.gpg-agent-info"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">29: </span>                . <span style="color: #bc8f8f;">"${HOME}/.gpg-agent-info"</span>
<span class="linenr">30: </span>                <span style="color: #00008b;">export</span> GPG_AGENT_INFO SSH_AUTH_SOCK
<span class="linenr">31: </span>            <span style="color: #4169e1;">fi</span>
<span class="linenr">32: </span>        <span style="color: #4169e1;">fi</span>
<span class="linenr">33: </span>        ;;
<span class="linenr">34: </span>    *)
<span class="linenr">35: </span>        <span style="color: #b22222;"># </span><span style="color: #b22222;">append pinentry-program since its location varied for each distro</span>
<span class="linenr">36: </span>        [ -z <span style="color: #bc8f8f;">"$(pgrep -u ${USER} -x gpg-agent)"</span> ] &amp;&amp;
<span class="linenr">37: </span>            gpg-agent --pinentry-program <span style="color: #bc8f8f;">"$(command -v pinentry)"</span> &gt;/dev/null 2&gt;&amp;1
<span class="linenr">38: </span>        ;;
<span class="linenr">39: </span><span style="color: #4169e1;">esac</span>
<span class="linenr">40: </span>
<span class="linenr">41: </span><span style="color: #00008b;">unset</span> SSH_AGENT_PID
<span class="linenr">42: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"${gnupg_SSH_AUTH_SOCK_by:-0}"</span> -ne $<span style="color: #b8860b;">$</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">43: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SSH_AUTH_SOCK</span>=<span style="color: #bc8f8f;">"$(gpgconf --list-dirs agent-ssh-socket)"</span>
<span class="linenr">44: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">45: </span>
<span class="linenr">46: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">keychain</span>
<span class="linenr">47: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">https://wiki.gentoo.org/wiki/Keychain</span>
<span class="linenr">48: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(command -v keychain)"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">49: </span>    [ -z <span style="color: #bc8f8f;">"${HOSTNAME}"</span> ] &amp;&amp; <span style="color: #b8860b;">HOSTNAME</span>=<span style="color: #bc8f8f;">"$(uname -n)"</span>
<span class="linenr">50: </span>    keychain --quiet --agents <span style="color: #bc8f8f;">"gpg,ssh"</span>
<span class="linenr">51: </span>    [ -f <span style="color: #bc8f8f;">"${HOME}/.keychain/${HOSTNAME}-sh"</span> ] &amp;&amp;
<span class="linenr">52: </span>        . <span style="color: #bc8f8f;">"${HOME}/.keychain/${HOSTNAME}-sh"</span>
<span class="linenr">53: </span>    [ -f <span style="color: #bc8f8f;">"${HOME}/.keychain/${HOSTNAME}-sh-gpg"</span> ] &amp;&amp;
<span class="linenr">54: </span>        . <span style="color: #bc8f8f;">"${HOME}/.keychain/${HOSTNAME}-sh-gpg"</span>
<span class="linenr">55: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd53ecfe" class="outline-4">
<h4 id="orgd53ecfe">file managers</h4>
<div class="outline-text-4" id="text-orgd53ecfe">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/05-filemanagers.sh</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">filemanager configuration</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">file manager</span>
<span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(command -v emacs)"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">FILE</span>=${<span style="color: #b8860b;">FILE</span>:-emacsclient -c -e <span style="color: #bc8f8f;">'(dired-jump)'</span>}
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(command -v ranger)"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">FILE</span>=${<span style="color: #b8860b;">FILE</span>:-ranger}
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(command -v pcmanfm)"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">FILE</span>=${<span style="color: #b8860b;">FILE</span>:-pcmanfm}
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(command -v thunar)"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">FILE</span>=${<span style="color: #b8860b;">FILE</span>:-thunar}
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(command -v caja)"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">FILE</span>=${<span style="color: #b8860b;">FILE</span>:-caja}
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(command -v nautilus)"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">FILE</span>=${<span style="color: #b8860b;">FILE</span>:-nautilus}
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(command -v nemo)"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">FILE</span>=${<span style="color: #b8860b;">FILE</span>:-nemo}
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(command -v dolphin)"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">FILE</span>=${<span style="color: #b8860b;">FILE</span>:-dolpin}
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(command -v rox)"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">FILE</span>=${<span style="color: #b8860b;">FILE</span>:-rox}
<span style="color: #4169e1;">fi</span>
</pre>
</div>
<p>
Most system I used will default to Emacs's <code>dired</code>, if you use Emacs you should know dired.
</p>
</div>
</div>
