index.org
*** cargo
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-cargo.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh
  # ~/.config/profile.d/99-cargo.sh
  # cargo configuration
  # https://wiki.archlinux.org/index.php/Rust#Cargo
  # <alexforsale@yahoo.com>

  if [ -d "$HOME/.cargo/bin" ];then
     export PATH=$HOME/.cargo/bin:$PATH
  fi
#+end_src
For when I'm playful and messing around with rust.
*** ccache
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-ccache.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-ccache.sh
  # ccache configuration
  # <alexforsale@yahoo.com>

  if [ "$(command -v ccache)" ] &&
         [ -d "/usr/lib/ccache/bin" ]; then
      if [ "${SHELL}" != "/bin/sh" ] &&
             [ "$(command -v pathprepend)" ]; then
          pathprepend /usr/lib/ccache/bin
      else
          export PATH=/usr/lib/ccache/bin:"${PATH}"
      fi
  fi

  case "${DISTRO}" in
      "gentoo")
          [ -r /var/cache/ccache ] &&
              export CCACHE_DIR="/var/cache/ccache"
          ;;
  esac
#+end_src
When turning on the monitor means compiling.

*** composer
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-composer.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-composer.sh
  # composer path configuration
  # <alexforsale@yahoo.com>

  if [ "$(command -v composer)" ] &&
     [ -d "${HOME}/.config/composer/vendor/bin" ]; then
     export PATH="${HOME}/.config/composer/vendor/bin:${PATH}"
  fi
#+end_src
I used composer once, but obligated to have this config.

*** dash
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-dash.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-dash.sh
  # configuration for dash shells and other sh equivalent
  # <alexforsale@yahoo.com>

  if ([ "${SHELL}" = "/bin/sh" ] || [ "${SHELL}" = "/bin/dash" ]);then
     ENV=${HOME}/.shrc; export ENV
     [ -x /usr/bin/resizewin ] && /usr/bin/resizewin -z
  fi
#+end_src
This ensures the =~/.shrc~= file get sourced if exists.

*** doom emacs
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-doom_emacs.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-doom_emacs.sh
  # doom emacs path
  # <alexforsale@yahoo.com>

  if [ "$(command -v emacs)" ] &&
      [ -e "${HOME}"/.emacs.d/bin/doom ]; then
      [ ! "$(command -v doom)" ] &&
          export PATH="${PATH}:${HOME}/.emacs.d/bin"
  elif [ -e "${HOME}/.config/doom/bin/doom" ]; then
      [ ! "$(command -v doom)" ] &&
          export PATH="${PATH}/.config/doom/bin"
  fi
#+end_src
Doom Emacs have its own scripts.
*** elinks
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-elinks.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-elinks.sh
  # configuration for elinks
  # <alexforsale@yahoo.com>

  if [ "$(command -v elinks)" ];then
     if [ -d "${XDG_CONFIG_HOME}"/elinks ];then
        if [ -d "${HOME}/.elinks" ]; then
            mv "${HOME}/.elinks" "${XDG_CONFIG_HOME}/elinks"
        else
            mkdir -p "${XDG_CONFIG_HOME}/elinks"
        fi
     fi
        export ELINKS_CONFDIR="${XDG_CONFIG_HOME}/elinks"
  fi
#+end_src
Before you ask: "why bother with elinks?", try gentoo, or worse, linuxfromscratch.
