index.html
<div id="outline-container-org7598764" class="outline-4">
<h4 id="org7598764">cargo</h4>
<div class="outline-text-4" id="text-org7598764">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-cargo.sh</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">cargo configuration</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">https://wiki.archlinux.org/index.php/Rust#Cargo</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>

<span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"$HOME/.cargo/bin"</span> ];<span style="color: #4169e1;">then</span>
   <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=$<span style="color: #b8860b;">HOME</span>/.cargo/bin:$<span style="color: #b8860b;">PATH</span>
<span style="color: #4169e1;">fi</span>
</pre>
</div>
<p>
For when I'm playful and messing around with rust.
</p>
</div>
</div>
<div id="outline-container-orgd4f7495" class="outline-4">
<h4 id="orgd4f7495">ccache</h4>
<div class="outline-text-4" id="text-orgd4f7495">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-ccache.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">ccache configuration</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(command -v ccache)"</span> ] &amp;&amp;
<span class="linenr"> 6: </span>       [ -d <span style="color: #bc8f8f;">"/usr/lib/ccache/bin"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 7: </span>    <span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"${SHELL}"</span> != <span style="color: #bc8f8f;">"/bin/sh"</span> ] &amp;&amp;
<span class="linenr"> 8: </span>           [ <span style="color: #bc8f8f;">"$(command -v pathprepend)"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 9: </span>        pathprepend /usr/lib/ccache/bin
<span class="linenr">10: </span>    <span style="color: #4169e1;">else</span>
<span class="linenr">11: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=/usr/lib/ccache/bin:<span style="color: #bc8f8f;">"${PATH}"</span>
<span class="linenr">12: </span>    <span style="color: #4169e1;">fi</span>
<span class="linenr">13: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span><span style="color: #4169e1;">case</span> <span style="color: #bc8f8f;">"${DISTRO}"</span><span style="color: #4169e1;"> in</span>
<span class="linenr">16: </span>    <span style="color: #bc8f8f;">"gentoo"</span>)
<span class="linenr">17: </span>        [ -r /var/cache/ccache ] &amp;&amp;
<span class="linenr">18: </span>            <span style="color: #00008b;">export</span> <span style="color: #b8860b;">CCACHE_DIR</span>=<span style="color: #bc8f8f;">"/var/cache/ccache"</span>
<span class="linenr">19: </span>        ;;
<span class="linenr">20: </span><span style="color: #4169e1;">esac</span>
</pre>
</div>
<p>
When turning on the monitor means compiling.
</p>
</div>
</div>

<div id="outline-container-org0b45d19" class="outline-4">
<h4 id="org0b45d19">composer</h4>
<div class="outline-text-4" id="text-org0b45d19">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr">1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-composer.sh</span>
<span class="linenr">2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">composer path configuration</span>
<span class="linenr">3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr">4: </span>
<span class="linenr">5: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(command -v composer)"</span> ] &amp;&amp;
<span class="linenr">6: </span>   [ -d <span style="color: #bc8f8f;">"${HOME}/.config/composer/vendor/bin"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">7: </span>   <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=<span style="color: #bc8f8f;">"${HOME}/.config/composer/vendor/bin:${PATH}"</span>
<span class="linenr">8: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
<p>
I used composer once, but obligated to have this config.
</p>
</div>
</div>

<div id="outline-container-org030e137" class="outline-4">
<h4 id="org030e137">dash</h4>
<div class="outline-text-4" id="text-org030e137">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr">1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-dash.sh</span>
<span class="linenr">2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">configuration for dash shells and other sh equivalent</span>
<span class="linenr">3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr">4: </span>
<span class="linenr">5: </span><span style="color: #4169e1;">if</span> ([ <span style="color: #bc8f8f;">"${SHELL}"</span> = <span style="color: #bc8f8f;">"/bin/sh"</span> ] || [ <span style="color: #bc8f8f;">"${SHELL}"</span> = <span style="color: #bc8f8f;">"/bin/dash"</span> ]);<span style="color: #4169e1;">then</span>
<span class="linenr">6: </span>   <span style="color: #b8860b;">ENV</span>=${<span style="color: #b8860b;">HOME</span>}/.shrc; <span style="color: #00008b;">export</span> ENV
<span class="linenr">7: </span>   [ -x /usr/bin/resizewin ] &amp;&amp; /usr/bin/resizewin -z
<span class="linenr">8: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
<p>
This ensures the <code>~/.shrc~</code> file get sourced if exists.
</p>
</div>
</div>

<div id="outline-container-org5a53dbe" class="outline-4">
<h4 id="org5a53dbe">doom emacs</h4>
<div class="outline-text-4" id="text-org5a53dbe">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-doom_emacs.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">doom emacs path</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(command -v emacs)"</span> ] &amp;&amp;
<span class="linenr"> 6: </span>    [ -e <span style="color: #bc8f8f;">"${HOME}"</span>/.emacs.d/bin/doom ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 7: </span>    [ ! <span style="color: #bc8f8f;">"$(command -v doom)"</span> ] &amp;&amp;
<span class="linenr"> 8: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=<span style="color: #bc8f8f;">"${PATH}:${HOME}/.emacs.d/bin"</span>
<span class="linenr"> 9: </span><span style="color: #4169e1;">elif</span> [ -e <span style="color: #bc8f8f;">"${HOME}/.config/doom/bin/doom"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">10: </span>    [ ! <span style="color: #bc8f8f;">"$(command -v doom)"</span> ] &amp;&amp;
<span class="linenr">11: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=<span style="color: #bc8f8f;">"${PATH}/.config/doom/bin"</span>
<span class="linenr">12: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
<p>
Doom Emacs have its own scripts.
</p>
</div>
</div>
<div id="outline-container-org6002f99" class="outline-4">
<h4 id="org6002f99">elinks</h4>
<div class="outline-text-4" id="text-org6002f99">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-elinks.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">configuration for elinks</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(command -v elinks)"</span> ];<span style="color: #4169e1;">then</span>
<span class="linenr"> 6: </span>   <span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}"</span>/elinks ];<span style="color: #4169e1;">then</span>
<span class="linenr"> 7: </span>      <span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.elinks"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 8: </span>          mv <span style="color: #bc8f8f;">"${HOME}/.elinks"</span> <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}/elinks"</span>
<span class="linenr"> 9: </span>      <span style="color: #4169e1;">else</span>
<span class="linenr">10: </span>          mkdir -p <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}/elinks"</span>
<span class="linenr">11: </span>      <span style="color: #4169e1;">fi</span>
<span class="linenr">12: </span>   <span style="color: #4169e1;">fi</span>
<span class="linenr">13: </span>      <span style="color: #00008b;">export</span> <span style="color: #b8860b;">ELINKS_CONFDIR</span>=<span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}/elinks"</span>
<span class="linenr">14: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
<p>
Before you ask: "why bother with elinks?", try gentoo, or worse, linuxfromscratch.
</p>
</div>
</div>
