index.org
*** emacs vterm
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-emacs_vterm.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-emacs-vterm.sh
  # https://github.com/akermu/emacs-libvterm
  # <alexforsale@yahoo.com>

  # dont' source this in sh
  if [ "${SHELL}" = "/bin/sh" ]; then
      return
  fi

  vterm_printf(){
      if [ -n "$TMUX" ]; then
          # Tell tmux to pass the escape sequences through
          # (Source: http://permalink.gmane.org/gmane.comp.terminal-emulators.tmux.user/1324)
          printf "\ePtmux;\e\e]%s\007\e\\" "$1"
      elif [ "${TERM%%-*}" = "screen" ]; then
          # GNU screen (screen, screen-256color, screen-256color-bce)
          printf "\eP\e]%s\007\e\\" "$1"
      else
          printf "\e]%s\e\\" "$1"
      fi
  }

  if [[ "$INSIDE_EMACS" = 'vterm' ]]; then
      function clear(){
          vterm_printf "51;Evterm-clear-scrollback";
          tput clear;
      }
  fi

  vterm_cmd() {
      local vterm_elisp
      vterm_elisp=""
      while [ $# -gt 0 ]; do
          vterm_elisp="$vterm_elisp""$(printf '"%s" ' "$(printf "%s" "$1" | sed -e 's|\\|\\\\|g' -e 's|"|\\"|g')")"
          shift
      done
      vterm_printf "51;E$vterm_elisp"
  }
#+end_src
Perhaps later version of vterm doesn't really need this anymore?

*** freeBSD
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-freebsd.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-freebsd.sh
  # configuration for FreeBSD
  # <alexforsale@yahoo.com>

  if [ "${DISTRO}" = "freebsd" ]; then
     [ -z "${ENV}" ] && ENV=${HOME}/.shrc
     export ENV
     export PAGER=less
     [ -x /usr/bin/resizewin ] && /usr/bin/resizewin -z
     [ -x /usr/bin/fortune ] && /usr/bin/fortune freebsd-tips
     # Let sh(1) know it's at home, despite /home being a symlink.
     if [ "$PWD" != "$HOME" ] && [ "$PWD" -ef "$HOME" ]; then cd || return; fi
     cd "${HOME}" || exit
  fi
#+end_src

*** fsharp
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-fsharp.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-fsharp.sh
  # configuration for F#
  # <alexforsale@yahoo.com>

  if [[ -d "${HOME}/.dotnet/tools" ]] &&
         [[ $(command -v dotnet) ]]; then
      export PATH="${PATH}:${HOME}/.dotnet/tools"
  fi
#+end_src
Just to make me looks like a programmer.
*** ghcup
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-ghcup.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-ghcup.sh
  # haskell's ghcup configuration
  # <alexforsale@yahoo.com>

  [ -f "/home/alexforsale/.ghcup/env" ] && source "/home/alexforsale/.ghcup/env" # ghcup-env

  if [ -d "${HOME}/.ghcup/bin" ]; then
      contains "${PATH}" "${HOME}/.ghcup/bin" ||
          export PATH="${HOME}/.ghcup/bin:${PATH}"
  fi
#+end_src

*** go
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-go.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-go.sh
  # $GOPATH configuration
  # <alexforsale@yahoo.com>

  if [ "$(command -v go)" ];then
     # set GOPATH to ~/.local so we don't need
     # to add more PATH
     export GOPATH=${GOPATH:-~/.local}
  fi
#+end_src

