index.html
<div id="outline-container-orge0579dd" class="outline-4">
<h4 id="orge0579dd">emacs vterm</h4>
<div class="outline-text-4" id="text-orge0579dd">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-emacs-vterm.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">https://github.com/akermu/emacs-libvterm</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">dont' source this in sh</span>
<span class="linenr"> 6: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"${SHELL}"</span> = <span style="color: #bc8f8f;">"/bin/sh"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 7: </span>    <span style="color: #4169e1;">return</span>
<span class="linenr"> 8: </span><span style="color: #4169e1;">fi</span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #0000ff;">vterm_printf</span>(){
<span class="linenr">11: </span>    <span style="color: #4169e1;">if</span> [ -n <span style="color: #bc8f8f;">"$TMUX"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">12: </span>        <span style="color: #b22222;"># </span><span style="color: #b22222;">Tell tmux to pass the escape sequences through</span>
<span class="linenr">13: </span>        <span style="color: #b22222;"># </span><span style="color: #b22222;">(Source: http://permalink.gmane.org/gmane.comp.terminal-emulators.tmux.user/1324)</span>
<span class="linenr">14: </span>        printf <span style="color: #bc8f8f;">"\ePtmux;\e\e]%s\007\e\\"</span> <span style="color: #bc8f8f;">"$1"</span>
<span class="linenr">15: </span>    <span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"${TERM%%-*}"</span> = <span style="color: #bc8f8f;">"screen"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">16: </span>        <span style="color: #b22222;"># </span><span style="color: #b22222;">GNU screen (screen, screen-256color, screen-256color-bce)</span>
<span class="linenr">17: </span>        printf <span style="color: #bc8f8f;">"\eP\e]%s\007\e\\"</span> <span style="color: #bc8f8f;">"$1"</span>
<span class="linenr">18: </span>    <span style="color: #4169e1;">else</span>
<span class="linenr">19: </span>        printf <span style="color: #bc8f8f;">"\e]%s\e\\"</span> <span style="color: #bc8f8f;">"$1"</span>
<span class="linenr">20: </span>    <span style="color: #4169e1;">fi</span>
<span class="linenr">21: </span>}
<span class="linenr">22: </span>
<span class="linenr">23: </span><span style="color: #4169e1;">if</span> [[ <span style="color: #bc8f8f;">"$INSIDE_EMACS"</span> = <span style="color: #bc8f8f;">'vterm'</span> ]]; <span style="color: #4169e1;">then</span>
<span class="linenr">24: </span>    <span style="color: #4169e1;">function</span> <span style="color: #0000ff;">clear</span>(){
<span class="linenr">25: </span>        vterm_printf <span style="color: #bc8f8f;">"51;Evterm-clear-scrollback"</span>;
<span class="linenr">26: </span>        tput clear;
<span class="linenr">27: </span>    }
<span class="linenr">28: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">29: </span>
<span class="linenr">30: </span><span style="color: #0000ff;">vterm_cmd</span>() {
<span class="linenr">31: </span>    local vterm_elisp
<span class="linenr">32: </span>    <span style="color: #b8860b;">vterm_elisp</span>=<span style="color: #bc8f8f;">""</span>
<span class="linenr">33: </span>    <span style="color: #4169e1;">while</span> [ $<span style="color: #b8860b;">#</span> -gt 0 ]; <span style="color: #4169e1;">do</span>
<span class="linenr">34: </span>        <span style="color: #b8860b;">vterm_elisp</span>=<span style="color: #bc8f8f;">"$vterm_elisp""$(printf '"%s" ' "$(printf "%s" "$1" | sed -e 's|\\|\\\\|g' -e 's|"|\\"|g')")"</span>
<span class="linenr">35: </span>        <span style="color: #00008b;">shift</span>
<span class="linenr">36: </span>    <span style="color: #4169e1;">done</span>
<span class="linenr">37: </span>    vterm_printf <span style="color: #bc8f8f;">"51;E$vterm_elisp"</span>
<span class="linenr">38: </span>}
</pre>
</div>
<p>
Perhaps later version of vterm doesn't really need this anymore?
</p>
</div>
</div>

<div id="outline-container-org214192e" class="outline-4">
<h4 id="org214192e">freeBSD</h4>
<div class="outline-text-4" id="text-org214192e">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-freebsd.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">configuration for FreeBSD</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"${DISTRO}"</span> = <span style="color: #bc8f8f;">"freebsd"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 6: </span>   [ -z <span style="color: #bc8f8f;">"${ENV}"</span> ] &amp;&amp; <span style="color: #b8860b;">ENV</span>=${<span style="color: #b8860b;">HOME</span>}/.shrc
<span class="linenr"> 7: </span>   <span style="color: #00008b;">export</span> ENV
<span class="linenr"> 8: </span>   <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PAGER</span>=less
<span class="linenr"> 9: </span>   [ -x /usr/bin/resizewin ] &amp;&amp; /usr/bin/resizewin -z
<span class="linenr">10: </span>   [ -x /usr/bin/fortune ] &amp;&amp; /usr/bin/fortune freebsd-tips
<span class="linenr">11: </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">Let sh(1) know it's at home, despite /home being a symlink.</span>
<span class="linenr">12: </span>   <span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$PWD"</span> != <span style="color: #bc8f8f;">"$HOME"</span> ] &amp;&amp; [ <span style="color: #bc8f8f;">"$PWD"</span> -ef <span style="color: #bc8f8f;">"$HOME"</span> ]; <span style="color: #4169e1;">then </span><span style="color: #00008b;">cd</span> || <span style="color: #4169e1;">return</span>; <span style="color: #4169e1;">fi</span>
<span class="linenr">13: </span>   <span style="color: #00008b;">cd</span> <span style="color: #bc8f8f;">"${HOME}"</span> || <span style="color: #4169e1;">exit</span>
<span class="linenr">14: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba5d671" class="outline-4">
<h4 id="orgba5d671">fsharp</h4>
<div class="outline-text-4" id="text-orgba5d671">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr">1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-fsharp.sh</span>
<span class="linenr">2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">configuration for F#</span>
<span class="linenr">3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr">4: </span>
<span class="linenr">5: </span><span style="color: #4169e1;">if</span> [[ -d <span style="color: #bc8f8f;">"${HOME}/.dotnet/tools"</span> ]] &amp;&amp;
<span class="linenr">6: </span>       [[ $(command -v dotnet) ]]; <span style="color: #4169e1;">then</span>
<span class="linenr">7: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=<span style="color: #bc8f8f;">"${PATH}:${HOME}/.dotnet/tools"</span>
<span class="linenr">8: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
<p>
Just to make me looks like a programmer.
</p>
</div>
</div>
<div id="outline-container-org3b026b3" class="outline-4">
<h4 id="org3b026b3">ghcup</h4>
<div class="outline-text-4" id="text-org3b026b3">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-ghcup.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">haskell's ghcup configuration</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>[ -f <span style="color: #bc8f8f;">"/home/alexforsale/.ghcup/env"</span> ] &amp;&amp; source <span style="color: #bc8f8f;">"/home/alexforsale/.ghcup/env"</span> <span style="color: #b22222;"># </span><span style="color: #b22222;">ghcup-env</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.ghcup/bin"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 8: </span>    contains <span style="color: #bc8f8f;">"${PATH}"</span> <span style="color: #bc8f8f;">"${HOME}/.ghcup/bin"</span> ||
<span class="linenr"> 9: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=<span style="color: #bc8f8f;">"${HOME}/.ghcup/bin:${PATH}"</span>
<span class="linenr">10: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org21aa1b9" class="outline-4">
<h4 id="org21aa1b9">go</h4>
<div class="outline-text-4" id="text-org21aa1b9">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr">1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-go.sh</span>
<span class="linenr">2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">$GOPATH configuration</span>
<span class="linenr">3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr">4: </span>
<span class="linenr">5: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(command -v go)"</span> ];<span style="color: #4169e1;">then</span>
<span class="linenr">6: </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">set GOPATH to ~/.local so we don't need</span>
<span class="linenr">7: </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">to add more PATH</span>
<span class="linenr">8: </span>   <span style="color: #00008b;">export</span> <span style="color: #b8860b;">GOPATH</span>=${<span style="color: #b8860b;">GOPATH</span>:-~/.local}
<span class="linenr">9: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>
</div>
