index.org
*** guix
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-guix.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-guix.sh
  # guix configuration
  # <alexforsale@yahoo.com>

  if [ $(command -v guix) ]; then
      if [ -n "${GUIX_LOCPATH}" ];then
         # add /bin and /usr/bin to path
         # to add more PATH
         export PATH=${PATH}:/bin
         export PATH=${PATH}:/usr/bin
         # set the GUIX_BUILD_OPTIONS
         contains "${GUIX_BUILD_OPTIONS}" "-v 3 -c 2 -M 2" ||
             export GUIX_BUILD_OPTIONS="${GUIX_BUILD_OPTIONS} -v 3 -c 2 -M 2"
         if [ -d "${HOME}/.guix-profile/bin" ]; then
             export PATH="${HOME}/.guix-profile/bin:${PATH}"
         fi
         if [ -d "${HOME}/.guix-profile/sbin" ]; then
             export PATH="${HOME}/.guix-profile/sbin:${PATH}"
         fi
      fi

         if [ -d "${HOME}/.guix-profile/share/emacs/site-lisp" ]; then
             contains "${EMACSLOADPATH}" "${HOME}/.guix-profile/share/emacs/site-lisp" ||
                 export EMACSLOADPATH="${HOME}/.guix-profile/share/emacs/site-lisp:${EMACSLOADPATH}"
             contains "${XDG_DATA_DIRS}" "${HOME}/.guix-profile/share" ||
                 export XDG_DATA_DIRS="${HOME}/.guix-profile/share:${XDG_DATA_DIRS}"
         fi
      fi

  export QT_XCB_GL_INTEGRATION=none
#+end_src
Kinda redundant, if I'm using guix, this repository would never be used.
*** Opam
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-opam.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-nano.sh
  # <alexforsale@yahoo.com>

  if [ "$(command -v opam)" ]; then
      eval "$(opam env)"
  fi
#+end_src
*** nano
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-nano.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-nano.sh
  # see https://nano-editor.org
  # <alexforsale@yahoo.com>

  if [ "$(command -v nano)" ]; then
      if [ ! -d "${XDG_CONFIG_HOME}/nano" ]; then
          mkdir -p "${XDG_CONFIG_HOME}/nano"
          if [ -f "${HOME}/.nanorc" ]; then
              mv "${HOME}/.nanorc" "${XDG_CONFIG_HOME}/nanorc"
          fi
      else
          if [ -f "${HOME}/.nanorc" ]; then
              mv "${HOME}/.nanorc" "${XDG_HOME_CONFIG}/nanorc.bak"
          fi
      fi
      # backups
      mkdir -p "${XDG_CONFIG_HOME}/nano/backups"
  fi
#+end_src
My first exposure to the command line. Though I don't use nano anymore.
*** nix
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-nix.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-nix.sh
  # nix configuration
  # <alexforsale@yahoo.com>

  [ -d "${HOME}/.nix-profile/bin" ] && export PATH=${PATH}:${HOME}/.nix-profile/bin

  if [ -n "${GUIX_LOCPATH}" ]; then
      # source profile.d
      [ -e /run/current-system/profile/etc/profile.d/nix.sh ] && . /run/current-system/profile/etc/profile.d/nix.sh
      [ -e /run/current-system/profile/etc/profile.d/nix-daemon.sh ] && . /run/current-system/profile/etc/profile.d/nix-daemon.sh
      if [ -d "${HOME}/.nix-profile/share/icons" ]; then
          contains "${XCURSOR_PATH}" "${HOME}/.nix-profile/share/icons" ||
              export XCURSOR_PATH="${XCURSOR_PATH}:${HOME}/.nix-profile/share/icons"
      fi
      if [ -d "${HOME}/.nix-profile/share" ]; then
          contains "${XDG_DATA_DIRS}" "${HOME}/.nix-profile/share" ||
              export XDG_DATA_DIRS="${HOME}/.nix-profile/share:${XDG_DATA_DIRS}"
      fi
  fi
#+end_src
Hipsters use /nix/.
