index.html

<div id="outline-container-orgb1eaf6f" class="outline-4">
<h4 id="orgb1eaf6f">guix</h4>
<div class="outline-text-4" id="text-orgb1eaf6f">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-guix.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">guix configuration</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #4169e1;">if</span> [ $(command -v guix) ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 6: </span>    <span style="color: #4169e1;">if</span> [ -n <span style="color: #bc8f8f;">"${GUIX_LOCPATH}"</span> ];<span style="color: #4169e1;">then</span>
<span class="linenr"> 7: </span>       <span style="color: #b22222;"># </span><span style="color: #b22222;">add /bin and /usr/bin to path</span>
<span class="linenr"> 8: </span>       <span style="color: #b22222;"># </span><span style="color: #b22222;">to add more PATH</span>
<span class="linenr"> 9: </span>       <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=${<span style="color: #b8860b;">PATH</span>}:/bin
<span class="linenr">10: </span>       <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=${<span style="color: #b8860b;">PATH</span>}:/usr/bin
<span class="linenr">11: </span>       <span style="color: #b22222;"># </span><span style="color: #b22222;">set the GUIX_BUILD_OPTIONS</span>
<span class="linenr">12: </span>       contains <span style="color: #bc8f8f;">"${GUIX_BUILD_OPTIONS}"</span> <span style="color: #bc8f8f;">"-v 3 -c 2 -M 2"</span> ||
<span class="linenr">13: </span>           <span style="color: #00008b;">export</span> <span style="color: #b8860b;">GUIX_BUILD_OPTIONS</span>=<span style="color: #bc8f8f;">"${GUIX_BUILD_OPTIONS} -v 3 -c 2 -M 2"</span>
<span class="linenr">14: </span>       <span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.guix-profile/bin"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">15: </span>           <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=<span style="color: #bc8f8f;">"${HOME}/.guix-profile/bin:${PATH}"</span>
<span class="linenr">16: </span>       <span style="color: #4169e1;">fi</span>
<span class="linenr">17: </span>       <span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.guix-profile/sbin"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">18: </span>           <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=<span style="color: #bc8f8f;">"${HOME}/.guix-profile/sbin:${PATH}"</span>
<span class="linenr">19: </span>       <span style="color: #4169e1;">fi</span>
<span class="linenr">20: </span>    <span style="color: #4169e1;">fi</span>
<span class="linenr">21: </span>
<span class="linenr">22: </span>       <span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.guix-profile/share/emacs/site-lisp"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">23: </span>           contains <span style="color: #bc8f8f;">"${EMACSLOADPATH}"</span> <span style="color: #bc8f8f;">"${HOME}/.guix-profile/share/emacs/site-lisp"</span> ||
<span class="linenr">24: </span>               <span style="color: #00008b;">export</span> <span style="color: #b8860b;">EMACSLOADPATH</span>=<span style="color: #bc8f8f;">"${HOME}/.guix-profile/share/emacs/site-lisp:${EMACSLOADPATH}"</span>
<span class="linenr">25: </span>           contains <span style="color: #bc8f8f;">"${XDG_DATA_DIRS}"</span> <span style="color: #bc8f8f;">"${HOME}/.guix-profile/share"</span> ||
<span class="linenr">26: </span>               <span style="color: #00008b;">export</span> <span style="color: #b8860b;">XDG_DATA_DIRS</span>=<span style="color: #bc8f8f;">"${HOME}/.guix-profile/share:${XDG_DATA_DIRS}"</span>
<span class="linenr">27: </span>       <span style="color: #4169e1;">fi</span>
<span class="linenr">28: </span>    <span style="color: #4169e1;">fi</span>
<span class="linenr">29: </span>
<span class="linenr">30: </span><span style="color: #00008b;">export</span> <span style="color: #b8860b;">QT_XCB_GL_INTEGRATION</span>=none
</pre>
</div>
<p>
Kinda redundant, if I'm using guix, this repository would never be used.
</p>
</div>
</div>
<div id="outline-container-org56548fb" class="outline-4">
<h4 id="org56548fb">nano</h4>
<div class="outline-text-4" id="text-org56548fb">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-nano.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">see https://nano-editor.org</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(command -v nano)"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 6: </span>    <span style="color: #4169e1;">if</span> [ ! -d <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}/nano"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 7: </span>        mkdir -p <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}/nano"</span>
<span class="linenr"> 8: </span>        <span style="color: #4169e1;">if</span> [ -f <span style="color: #bc8f8f;">"${HOME}/.nanorc"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 9: </span>            mv <span style="color: #bc8f8f;">"${HOME}/.nanorc"</span> <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}/nanorc"</span>
<span class="linenr">10: </span>        <span style="color: #4169e1;">fi</span>
<span class="linenr">11: </span>    <span style="color: #4169e1;">else</span>
<span class="linenr">12: </span>        <span style="color: #4169e1;">if</span> [ -f <span style="color: #bc8f8f;">"${HOME}/.nanorc"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">13: </span>            mv <span style="color: #bc8f8f;">"${HOME}/.nanorc"</span> <span style="color: #bc8f8f;">"${XDG_HOME_CONFIG}/nanorc.bak"</span>
<span class="linenr">14: </span>        <span style="color: #4169e1;">fi</span>
<span class="linenr">15: </span>    <span style="color: #4169e1;">fi</span>
<span class="linenr">16: </span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">backups</span>
<span class="linenr">17: </span>    mkdir -p <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}/nano/backups"</span>
<span class="linenr">18: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
<p>
My first exposure to the command line. Though I don't use nano anymore.
</p>
</div>
</div>
<div id="outline-container-org5b831f2" class="outline-4">
<h4 id="org5b831f2">nix</h4>
<div class="outline-text-4" id="text-org5b831f2">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-nix.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">nix configuration</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>[ -d <span style="color: #bc8f8f;">"${HOME}/.nix-profile/bin"</span> ] &amp;&amp; <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PATH</span>=${<span style="color: #b8860b;">PATH</span>}:${<span style="color: #b8860b;">HOME</span>}/.nix-profile/bin
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #4169e1;">if</span> [ -n <span style="color: #bc8f8f;">"${GUIX_LOCPATH}"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 8: </span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">source profile.d</span>
<span class="linenr"> 9: </span>    [ -e /run/current-system/profile/etc/profile.d/nix.sh ] &amp;&amp; . /run/current-system/profile/etc/profile.d/nix.sh
<span class="linenr">10: </span>    [ -e /run/current-system/profile/etc/profile.d/nix-daemon.sh ] &amp;&amp; . /run/current-system/profile/etc/profile.d/nix-daemon.sh
<span class="linenr">11: </span>    <span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.nix-profile/share/icons"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">12: </span>        contains <span style="color: #bc8f8f;">"${XCURSOR_PATH}"</span> <span style="color: #bc8f8f;">"${HOME}/.nix-profile/share/icons"</span> ||
<span class="linenr">13: </span>            <span style="color: #00008b;">export</span> <span style="color: #b8860b;">XCURSOR_PATH</span>=<span style="color: #bc8f8f;">"${XCURSOR_PATH}:${HOME}/.nix-profile/share/icons"</span>
<span class="linenr">14: </span>    <span style="color: #4169e1;">fi</span>
<span class="linenr">15: </span>    <span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.nix-profile/share"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">16: </span>        contains <span style="color: #bc8f8f;">"${XDG_DATA_DIRS}"</span> <span style="color: #bc8f8f;">"${HOME}/.nix-profile/share"</span> ||
<span class="linenr">17: </span>            <span style="color: #00008b;">export</span> <span style="color: #b8860b;">XDG_DATA_DIRS</span>=<span style="color: #bc8f8f;">"${HOME}/.nix-profile/share:${XDG_DATA_DIRS}"</span>
<span class="linenr">18: </span>    <span style="color: #4169e1;">fi</span>
<span class="linenr">19: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
<p>
Hipsters use <i>nix</i>.
</p>
</div>
</div>
