index.org
*** npm
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-npm.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-npm.sh
  # node packaged module configuration
  # see https://wiki.archlinux.org/index.php/Node.js
  # <alexforsale@yahoo.com>

  if [ -d "${HOME}/.config/nvm" ]; then
      export NVM_DIR="${HOME}/.config/nvm"
      [ -s "${NVM_DIR}/nvm.sh" ] && \. "${NVM_DIR}/nvm.sh"  # This loads nvm
      [ -n "${BASH}" ] &&
          [ -s "${NVM_DIR}/bash_completion" ] && \. "${NVM_DIR}/bash_completion"  # This loads nvm bash_completion
      if [ -n "${npm_config_prefix}" ]; then
          unset npm_config_prefix
      fi
  elif [ "$(command -v npm)" ] && [ ! "$(command -v nvm)" ]; then
     export npm_config_prefix="${HOME}/.local"
  fi
#+end_src

*** password-store
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-password-store.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-password-store.sh
  # configuration for pass
  # <alexforsale@yahoo.com>

  if [ -f /run/current-system/profile/lib/password-store/extensions/otp.bash ]; then
      [ ! -L "${HOME}/.password-store/.extensions/otp.bash" ] &&
          ln -s /run/current-system/profile/lib/password-store/extensions/otp.bash \
              "${HOME}/.password-store/.extensions/"
      export PASSWORD_STORE_ENABLE_EXTENSIONS=true
  fi
#+end_src
This app should have more love!
*** perl
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-perl.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-perl.sh
  # configuration for perl
  # <alexforsale@yahoo.com>

  [ ! -d "${HOME}/.local/perl5/bin" ] &&
      mkdir -p "${HOME}/.local/perl5/bin"
  [ ! -d "${HOME}/.local/perl5/lib/perl5" ] &&
      mkdir -p "${HOME}/.local/perl5/lib/perl5"

  PATH="${HOME}/.local/perl5/bin${PATH:+:${PATH}}"
  PERL5LIB="${HOME}/.local/perl5/lib/perl5${PERL5LIB:+:${PERL5LIB}}"
  PERL_LOCAL_LIB_ROOT="${HOME}/.local/perl5${PERL_LOCAL_LIB_ROOT:+:${PERL_LOCAL_LIB_ROOT}}"
  PERL_MB_OPT="--install_base \"${HOME}/.local/perl5\""
  PERL_MM_OPT="INSTALL_BASE=${HOME}/.local/perl5"

  export PATH PERL5LIB PERL_LOCAL_LIB_ROOT PERL_MB_OPT PERL_MM_OPT
#+end_src

*** python
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-python.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-python.sh
  # Python configuration
  # <alexforsale@yahoo.com>

  if [ $(command -v pipenv) ]; then
      [ -z "${PIPENV_VENV_IN_PROJECT}" ] &&
          export PIPENV_VENV_IN_PROJECT=1
  fi

  # pyenv
  if [ $(command -v pyenv) ]; then
      eval "$(pyenv init -)"
  fi
#+end_src

*** ruby
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-ruby.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh -n
  # ~/.config/profile.d/99-ruby.sh
  # ruby configuration
  # <alexforsale@yahoo.com>

  if [ "$(command -v ruby)" ] &&
         [ -d "$(ruby -e 'print Gem.user_dir')/bin" ];then
     PATH="$(ruby -e 'print Gem.user_dir')/bin:$PATH"
     export GEM_HOME="$(ruby -e 'puts Gem.user_dir')"
  fi

  export PATH
#+end_src

*** screen
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-screen.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh
  # ~/.config/profile.d/99-screen.sh
  # configuration for GNU Screen
  # <alexforsale@yahoo.com>

  if [ "$(command -v screen)" ] &&
         [ ! -d "${XDG_CONFIG_HOME}/screen" ]; then
      if [ -d "${HOME}/.screen" ]; then
          mv "${HOME}/.screen" "${XDG_CONFIG_HOME}/screen"
      else
          mkdir -p "${XDG_CONFIG_HOME}/screen"
      fi
  fi
  export SCREENDIR="${XDG_CONFIG_HOME}/screen"
  chmod 700 "${SCREENDIR}"
  export SCREENRC="${SCREENDIR}/config"
#+end_src
Better than /tmux/. That statement just to annoy tmux users.
*** [[https://virtualenvwrapper.readthedocs.io/en/latest/][virtualenvwrapper]]
:PROPERTIES:
:header-args: :tangle .config/profile.d/99-virtualenvwrapper.sh :mkdirp t :shebang #!/bin/sh
:END:

#+begin_src sh
  # ~/.config/profile.d/99-virtualenvwrapper.sh
  # configuration for virtualenvwrapper
  # <alexforsale@yahoo.com>

  if [ -d "${HOME}/.virtualenvs" ]; then
      export WORKON_HOME="${HOME}/.virtualenvs"
  fi

  if [ -x /usr/bin/virtualenvwrapper.sh ]; then
      . /usr/bin/virtualenvwrapper.sh
  fi
#+end_src
