index.html
<div id="outline-container-orga883b5c" class="outline-4">
<h4 id="orga883b5c">npm</h4>
<div class="outline-text-4" id="text-orga883b5c">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-npm.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">node packaged module configuration</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">see https://wiki.archlinux.org/index.php/Node.js</span>
<span class="linenr"> 4: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.config/nvm"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 7: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">NVM_DIR</span>=<span style="color: #bc8f8f;">"${HOME}/.config/nvm"</span>
<span class="linenr"> 8: </span>    [ -s <span style="color: #bc8f8f;">"${NVM_DIR}/nvm.sh"</span> ] &amp;&amp; <span style="color: #bc8f8f;">\.</span> <span style="color: #bc8f8f;">"${NVM_DIR}/nvm.sh"</span>  <span style="color: #b22222;"># </span><span style="color: #b22222;">This loads nvm</span>
<span class="linenr"> 9: </span>    [ -n <span style="color: #bc8f8f;">"${BASH}"</span> ] &amp;&amp;
<span class="linenr">10: </span>        [ -s <span style="color: #bc8f8f;">"${NVM_DIR}/bash_completion"</span> ] &amp;&amp; <span style="color: #bc8f8f;">\.</span> <span style="color: #bc8f8f;">"${NVM_DIR}/bash_completion"</span>  <span style="color: #b22222;"># </span><span style="color: #b22222;">This loads nvm bash_completion</span>
<span class="linenr">11: </span>    <span style="color: #4169e1;">if</span> [ -n <span style="color: #bc8f8f;">"${npm_config_prefix}"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">12: </span>        <span style="color: #00008b;">unset</span> npm_config_prefix
<span class="linenr">13: </span>    <span style="color: #4169e1;">fi</span>
<span class="linenr">14: </span><span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(command -v npm)"</span> ] &amp;&amp; [ ! <span style="color: #bc8f8f;">"$(command -v nvm)"</span> ]; <span style="color: #4169e1;">then</span>
<span class="linenr">15: </span>   <span style="color: #00008b;">export</span> <span style="color: #b8860b;">npm_config_prefix</span>=<span style="color: #bc8f8f;">"${HOME}/.local"</span>
<span class="linenr">16: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b9cd8e" class="outline-4">
<h4 id="org9b9cd8e">password-store</h4>
<div class="outline-text-4" id="text-org9b9cd8e">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-password-store.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">configuration for pass</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #4169e1;">if</span> [ -f /run/current-system/profile/lib/password-store/extensions/otp.bash ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 6: </span>    [ ! -L <span style="color: #bc8f8f;">"${HOME}/.password-store/.extensions/otp.bash"</span> ] &amp;&amp;
<span class="linenr"> 7: </span>        ln -s /run/current-system/profile/lib/password-store/extensions/otp.bash <span style="color: #bc8f8f;">\</span>
<span class="linenr"> 8: </span>            <span style="color: #bc8f8f;">"${HOME}/.password-store/.extensions/"</span>
<span class="linenr"> 9: </span>    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PASSWORD_STORE_ENABLE_EXTENSIONS</span>=true
<span class="linenr">10: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
<p>
This app should have more love!
</p>
</div>
</div>
<div id="outline-container-org4505a3d" class="outline-4">
<h4 id="org4505a3d">perl</h4>
<div class="outline-text-4" id="text-org4505a3d">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-perl.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">configuration for perl</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>[ ! -d <span style="color: #bc8f8f;">"${HOME}/.local/perl5/bin"</span> ] &amp;&amp;
<span class="linenr"> 6: </span>    mkdir -p <span style="color: #bc8f8f;">"${HOME}/.local/perl5/bin"</span>
<span class="linenr"> 7: </span>[ ! -d <span style="color: #bc8f8f;">"${HOME}/.local/perl5/lib/perl5"</span> ] &amp;&amp;
<span class="linenr"> 8: </span>    mkdir -p <span style="color: #bc8f8f;">"${HOME}/.local/perl5/lib/perl5"</span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #b8860b;">PATH</span>=<span style="color: #bc8f8f;">"${HOME}/.local/perl5/bin${PATH:+:${PATH}}"</span>
<span class="linenr">11: </span><span style="color: #b8860b;">PERL5LIB</span>=<span style="color: #bc8f8f;">"${HOME}/.local/perl5/lib/perl5${PERL5LIB:+:${PERL5LIB}}"</span>
<span class="linenr">12: </span><span style="color: #b8860b;">PERL_LOCAL_LIB_ROOT</span>=<span style="color: #bc8f8f;">"${HOME}/.local/perl5${PERL_LOCAL_LIB_ROOT:+:${PERL_LOCAL_LIB_ROOT}}"</span>
<span class="linenr">13: </span><span style="color: #b8860b;">PERL_MB_OPT</span>=<span style="color: #bc8f8f;">"--install_base \"${HOME}/.local/perl5\""</span>
<span class="linenr">14: </span><span style="color: #b8860b;">PERL_MM_OPT</span>=<span style="color: #bc8f8f;">"INSTALL_BASE=${HOME}/.local/perl5"</span>
<span class="linenr">15: </span>
<span class="linenr">16: </span><span style="color: #00008b;">export</span> PATH PERL5LIB PERL_LOCAL_LIB_ROOT PERL_MB_OPT PERL_MM_OPT
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea90d66" class="outline-4">
<h4 id="orgea90d66">python</h4>
<div class="outline-text-4" id="text-orgea90d66">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-python.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Python configuration</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #4169e1;">if</span> [ $(command -v pipenv) ]; <span style="color: #4169e1;">then</span>
<span class="linenr"> 6: </span>    [ -z <span style="color: #bc8f8f;">"${PIPENV_VENV_IN_PROJECT}"</span> ] &amp;&amp;
<span class="linenr"> 7: </span>        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PIPENV_VENV_IN_PROJECT</span>=1
<span class="linenr"> 8: </span><span style="color: #4169e1;">fi</span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">pyenv</span>
<span class="linenr">11: </span><span style="color: #4169e1;">if</span> [ $(command -v pyenv) ]; <span style="color: #4169e1;">then</span>
<span class="linenr">12: </span>    <span style="color: #00008b;">eval</span> <span style="color: #bc8f8f;">"$(pyenv init -)"</span>
<span class="linenr">13: </span><span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgefd3b92" class="outline-4">
<h4 id="orgefd3b92">ruby</h4>
<div class="outline-text-4" id="text-orgefd3b92">
<div class="org-src-container">
<pre class="src src-sh"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-ruby.sh</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">ruby configuration</span>
<span class="linenr"> 3: </span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(command -v ruby)"</span> ] &amp;&amp;
<span class="linenr"> 6: </span>       [ -d <span style="color: #bc8f8f;">"$(ruby -e 'print Gem.user_dir')/bin"</span> ];<span style="color: #4169e1;">then</span>
<span class="linenr"> 7: </span>   <span style="color: #b8860b;">PATH</span>=<span style="color: #bc8f8f;">"$(ruby -e 'print Gem.user_dir')/bin:$PATH"</span>
<span class="linenr"> 8: </span>   <span style="color: #00008b;">export</span> <span style="color: #b8860b;">GEM_HOME</span>=<span style="color: #bc8f8f;">"$(ruby -e 'puts Gem.user_dir')"</span>
<span class="linenr"> 9: </span><span style="color: #4169e1;">fi</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #00008b;">export</span> PATH
</pre>
</div>
</div>
</div>

<div id="outline-container-org4828c7b" class="outline-4">
<h4 id="org4828c7b">screen</h4>
<div class="outline-text-4" id="text-org4828c7b">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/profile.d/99-screen.sh</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">configuration for GNU Screen</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>

<span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(command -v screen)"</span> ] &amp;&amp;
       [ ! -d <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}/screen"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.screen"</span> ]; <span style="color: #4169e1;">then</span>
        mv <span style="color: #bc8f8f;">"${HOME}/.screen"</span> <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}/screen"</span>
    <span style="color: #4169e1;">else</span>
        mkdir -p <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}/screen"</span>
    <span style="color: #4169e1;">fi</span>
<span style="color: #4169e1;">fi</span>
<span style="color: #00008b;">export</span> <span style="color: #b8860b;">SCREENDIR</span>=<span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}/screen"</span>
chmod 700 <span style="color: #bc8f8f;">"${SCREENDIR}"</span>
<span style="color: #00008b;">export</span> <span style="color: #b8860b;">SCREENRC</span>=<span style="color: #bc8f8f;">"${SCREENDIR}/config"</span>
</pre>
</div>
<p>
Better than <i>tmux</i>. That statement just to annoy tmux users.
</p>
</div>
</div>
</div>
</div>
